In [1]:
import pandas as pd

In [2]:
names = ['Bob', 'Jessica', 'Mary', 'John', 'Mel']
births = [123,456, 789, 112, 345]
custom = [1, 5, 25, 13, 23232]

In [3]:
data_set = list(zip(names, births, custom))
df = pd.DataFrame(data = data_set, columns = ['Names', 'births', 'custom'])

In [4]:
# 데이터 프레임 상단부분 출력
df.head()

     Names  births  custom
0      Bob     123       1
1  Jessica     456       5
2     Mary     789      25
3     John     112      13
4      Mel     345   23232

In [5]:
# 데이터 프레임의 열 타입 정보 출력
df.dtypes

Names     object
births     int64
custom     int64
dtype: object

In [6]:
# 인덱스 정보
df.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
# 열 정보
df.columns

Index(['Names', 'births', 'custom'], dtype='object')

In [8]:
# 하나의 열 선택
df['Names']

0        Bob
1    Jessica
2       Mary
3       John
4        Mel
Name: Names, dtype: object

In [9]:
# 데이터 프레임 인덱스 선택
df[:3]

     Names  births  custom
0      Bob     123       1
1  Jessica     456       5
2     Mary     789      25

In [10]:
# 조건 추가해서 선택
df[df['births'] > 200]

     Names  births  custom
1  Jessica     456       5
2     Mary     789      25
4      Mel     345   23232

In [11]:
# 평균값 계산
df.mean()

C:\Users\jinw0\AppData\Local\Temp\ipykernel_10868\3924456171.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

births     365.0
custom    4655.2
dtype: float64